Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: % доверительного интервала.
en: % confidence interval.

source: % — выделить переменные в коде (добавляются множественные курсоры);
en: % — select variables in the code (multiple cursors are added);

source: %kbd Alt G % — группировка списка;
en: %kbd Alt G %: group list;

source: %kbd Alt P % — публикация.
en: %kbd Alt P % — publishing.

source: %kbd Ctrl / % — закомментировать/раскомментировать код.
en: %kbd Ctrl / % — comment out/uncomment the code.

source: %kbd Ctrl D % — фильтровать список;
en: %kbd Ctrl D %: filter list;

source: %kbd Ctrl Down % — Переместить вниз.
en: %kbd Ctrl Down %: move down.

source: %kbd Ctrl Down % — Переместить вниз;
en: %kbd Ctrl Down %: move down.

source: %kbd Ctrl I % — показать тип переменной;
en: %kbd Ctrl I % — show the variable type;

source: %kbd Ctrl O % — открытие Пакета;
en: %kbd Ctrl O % — open the Package;

source: %kbd Ctrl O % — показать описание переменной;
en: %kbd Ctrl O % — show the variable description;

source: %kbd Ctrl Q % — переименовать переменную;
en: %kbd Ctrl Q % — rename the variable;

source: %kbd Ctrl S % — сохранение Пакета;
en: %kbd Ctrl S % — save the Package;

source: %kbd Ctrl Shift S % — сохранение всех Пакетов;
en: %kbd Ctrl Shift S % — save all Packages;

source: %kbd Ctrl Space % — автодополнение кода;
en: %kbd Ctrl Space % — code completion;

source: %kbd Ctrl Up % — Переместить вверх;
en: %kbd Ctrl Up %: move up.

source: %kbd Delete % — Удалить выбранные.
en: %kbd Delete %: delete selected.

source: %kbd Delete % — удалить подключение.
en: %kbd Delete %: delete connection.

source: %kbd Delete % — удалить;
en: %kbd Delete %: delete.

source: %kbd Enter % — настроить подключение;
en: %kbd Enter %: configure connection;

source: %kbd F2 % — Редактировать;
en: %kbd F2 %: edit.

source: %kbd F2 % — переименовать подключение;
en: %kbd F2 %: rename connection;

source: %kbd F2 % — редактирование свойств;
en: %kbd F2 % — edit properties;

source: %kbd F3 % — активировать подключение;
en: %kbd F3 %: activate connection;

source: %kbd Shift Delete % — удалить все;
en: %kbd Shift Delete %: delete all.

source: %kbd Shift F3 % — тестировать подключение;
en: %kbd Shift F3 %: test connection;

source: %spoiler%Горячие клавиши%spoiler%
en: %spoiler%Hotkeys%spoiler%

source: %spoiler%Горячие клавиши:%spoiler%
en: %spoiler%Hotkeys:%spoiler%

source: %spoiler%Пример заполнения:%spoiler%
en: %spoiler%Example of filling in:%spoiler%

source: %spoiler%Пример комментария:%spoiler%
en: %spoiler%The comment example:%spoiler%

source: %spoiler%Пример%spoiler%
en: %spoiler%Example%spoiler%

source: %spoiler%Пример:%spoiler%
en: %spoiler%Example:%spoiler%

source: %spoiler%Примеры входных наборов:%spoiler%
en: %spoiler%Examples of input data sets:%spoiler%

source: %spoiler%Примеры%spoiler%
en: %spoiler%Examples%spoiler%

source: %spoiler%Структура данных:%spoiler%
en: %spoiler%Data structure:%spoiler%

source: &#124; Округлено
en: &#124; Rounded

source: (Год + Месяц)
en: (Year + Month)

source: (Город = <VAR1>) И (Имя = <VAR2>) И (Возраст >= <VAR3>) И (Пол = <VAR4>) ИЛИ (Город = <VAR5>)
en: (City = <VAR1>) AND (Name = <VAR2>) AND (Age>= <VAR3>) AND (Sex = <VAR4>) OR (City = <VAR5>)

source: (Город = Москва) И (Имя = Саша) И (Возраст >= 30) И (Пол = мужской) ИЛИ (Город = Тула)
en: (City = Moscow) AND (Name = Sasha) AND (Age >= 30) AND (Sex = male) OR (City = Tula)

source: (см.
en: (refer to

source: (точка).
en: (Dot).

source: *Месяц.
en: *Month.

source: , где
en: where

source: - строка регулярного выражения;
en: - the regular expressions string.

source: -2 Логарифма функции правдоподобия
en: -2 Logarithm of the likelihood function

source: ... - числовые выражения.
en: ... - numeric expressions.

source: /* Многострочным комментарием
en: /* The multi-line comment

source: // require.resolve: // - на сервере Loginom возвращает полный путь модуля в файловом хранилище // - в Desktop версии возвращает полный путь модуля в файловой системе let path = require.resolve("child_module.js"); console.log(path); // Вызов внешнего модуля системы CommonJS let childModule = require("child_module.js"); console.log(childModule.filename); console.log(childModule.parent); console.log(childModule.loaded); // Очищается кэш модуля "child_module.js" delete require.cache[path]; // и внешний модуль вызывается повторно, // в результате чего повторно выводится "Hello!
en: // require.resolve: // - returns the full module path in the file storage on the Loginom server // - returns the full module path in the file system in the Desktop version let path = require.resolve("child_module.js"); console.log(path); // Calling of the external module of the CommonJS system let childModule = require("child_module.js"); console.log(childModule.filename); console.log(childModule.parent); console.log(childModule.loaded); // Cache of "child_module.js" module is cleared delete require.cache[path]; // and the external module is repeatedly called, // consequently, the following information is repeatedly displayed: "Hello!

source: // s = x.concat(n); - используется метод JavaScript
en: // s = x.concat(n); - the JavaScript method is used

source: // Без очистки кэша этого не происходит require("child_module.js");
en: // It is not possible without cache flush require("child_module.js");

source: // Вывод значений столбца с именем "CLASS"
en: // Outputting the values of the column with the "CLASS" name

source: // Вывод значений столбца с индексом 0
en: // Outputting the values of the column with 0 index

source: // Вычисление суммы полей let result; result = COL1 + COL2; return result;
en: // Calculation of the sum of fields let result; result = COL1 + COL2; return result;

source: // Вычисление суммы полей return COL1 + COL2;
en: // Calculation of the sum of fields return COL1 + COL2;

source: // Метод Append добавляет запись в набор
en: // Append method enables to append a record to data set

source: // Метод Get возвращает значение заданной строки в заданном столбце
en: // Get method returns the value of the set row in the set column

source: // Метод Get возвращает значение столбца по индексу
en: // Get method returns the column value by index

source: // Метод IsNull проверяет на Null значение заданной строки в заданном столбце
en: // IsNull method checks for the Null value of the set row in the set column

source: // Метод IsNull проверяет на Null значение столбца
en: // IsNull method checks for the Null column value

source: // Метод Set задает значение заданного поля в записи, созданной методом Append
en: // Set method enables to set the value of the set field to the records created by Append method

source: // Метод assert выводит в консоль сообщение, если первый аргумент false
en: // assert method enables to direct the message to console if the first argument is false

source: // Метод clear очищает консоль вывода сообщений в окне предпросмотра
en: // clear method enables to clean the message console in the preview window

source: // Метод error выводит сообщение об ошибке
en: // error method shows error message

source: // Методы info и log выводят информационное сообщение
en: // info and log methods show information message

source: // Методы warn выводит предупреждающее сообщение
en: // warn methods show warning message

source: // Обращение к переменной по индексу
en: // Access to the variable by index

source: // Пример однострочного комментария.
en: // Example of the single-line comment

source: // Статический импорт import { cube, sayHello } from "foo/foo.js"; console.log(sayHello()); console.log('3^3 = ', cube(3)); // Динамический импорт import("foo/foo.js").then(mod => {
en: // Static import import { cube, sayHello } from "foo/foo.js"; console.log(sayHello()); console.log('3^3 = ', cube(3)); // Dynamic import import("foo/foo.js").then(mod => {

source: // Функция вычисления степени числа function pow(x, n) {
en: // Function of calculation of the number power function pow(x, n) {

source: // Что-то делаем } // Вывод числового представления значения перечисления console.log(col0.DefaultUsageType); // Вывод строкового представления значения перечисления console.log(UsageType[col0.DefaultUsageType]);
en: // We are doing something } // Displaying of the numeric representation of the enumeration value console.log(col0.DefaultUsageType); // Displaying of the string representation of the enumeration value console.log(UsageType[col0.DefaultUsageType]);

source: // кэш модулей
en: // cache of modules

source: // функция resolve возвращает полный путь к модулю
en: // resolve function returns the full path to the module

source: 0 - Внутреннее соединение;
en: 0 - Inner join.

source: 0 - неопределенный; 1 – логический; 2 - дата/время; 3 – вещественный; 4 – целый; 5 – строковый; 6 – переменный.
en: 0 - undefined; 1 – logical; 2 - date/time; 3 – real; 4 – integer; 5 – string; 6 – variable.

source: 1 - Левое соединение;
en: 1 - Left join.

source: 1 - значение границы входит в интервал; 0 - значение границы не входит в интервал.
en: 1 - the bound value is included into the bin; 0 - the bound value is not included into the bin.

source: 1 - значение границы входит в интервал;0 - значение границы не входит в интервал
en: 1 - the bound value is included into the bin;0 - the bound value is not included into the bin

source: 1 столбец — заменяемое значение.
en: 1st column — replaced value.

source: 10 тысяч дочерних узлов
en: 10,000 child nodes

source: 2 - Правое соединение;
en: 2 - Right join.

source: 2 столбец — новое значение.
en: 2nd column — new value.

source: 3 - Полное соединение;
en: 3 - Full join.

source: 32-разрядные:
en: 32 bit:

source: 4 - Разность.
en: 4 - Difference.

source: 50 тысяч строк
en: 50,000 rows

source: 64-разрядные:
en: 64 bit:

source: табличном порту;
en: table port;

source: Входной источник данных — таблица данных.
en: Input data source — data table.

source: Коэффициенты модели — таблица данных, которая содержит следующие коэффициенты:
en: Model coefficients: the data table that contains the following coefficients:

source: порту переменных;
en: viraibles port;

source: / — скрывает / показывает список Таблицы/Представления.
en: / — hides/shows the Tables/Views list.

source: Переместить вверх/вниз — изменяет позицию выделенного элемента списка;
en: Move up/down enables to change the position of the selected list item.

source: XLS - экспорт в файл:
en: XLS: export to file:

source: Быстрый просмотр — вызывает окно просмотра значений переменных.
en: Quick view enables to call the variable watch window.

source: В колонках.
en: In columns.

source: В строках.
en: In rows.

source: Верхняя граница диапазонов открыта.
en: Upper bin bound open.

source: Верхняя граница открыта — убирает верхнюю границу;
en: Upper bound open: removes the upper bound.

source: Верхняя граница – для числовых признаков указывается верхняя граница интервала числом.
en: Upper bound: a number is used to denote the upper bin bound for the numeric indicators.

source: Вес доказательства – коэффициент WoE для каждого класса.
en: Weight of evidence: the WoE coefficient for each class.

source: Внутреннее соединение;
en: Inner join.

source: Все.
en: All.

source: Всего – общее число наблюдений в классе.
en: Total: the total number of observations in the class.

source: Входное — для данных, соответствующих дополнительным входным факторам.
en: Input: for the data mapping the additional input factors.

source: Входное — поле содержит значения одного из входных параметров.
en: Input: the field contains the values of one of the input parameters.

source: Входное — поле содержит значения одного из входных параметров;
en: Input: the field contains the values of one of the input parameters.

source: Выравнивание ширины колонок:
en: Column width adjustment:

source: Выражение;
en: Expression.

source: Выход модели — таблица данных, которая содержит следующие поля:
en: Model output: the data table that contains the following fields:

source: Выходное — поле содержит значения классов.
en: Output: the field contains the class values.

source: Выходное — поле содержит значения классов;
en: Output: the field contains the class values.

source: Выходной набор данных — таблица, содержащая данные о корреляции между полями.
en: Output data set: the table that contains information on correlation between the fields.

source: Группа – номер группы, к которой относится запись в таблице.
en: Group: the number of the group to which the table record relates.

source: Детализация — показать/скрыть детализацию.
en: Detailing: show/hide detailing.

source: Диаграмма — показать/скрыть диаграмму.
en: Chart: show/hide chart.

source: Добавить выражение по образцу — добавляет новое выражение с типом данных, описанием и формулой, как у текущего выражения;
en: Add expression by the example enables to add a new expression with data type, description and formula similar to the current expression.

source: Добавить выражение — добавляет новое выражение с параметрами по умолчанию;
en: Add expression enables to add a new expression with the default parameters.

source: Добавить вычисляемый факт… — открыть окно для добавления нового вычисляемого факта в куб^1.
en: Add calculated measure…: open the window to add the new calculated measure to ^1 cube.

source: Добавить — добавляет в список новый файл XSD-схемы, выбранный пользователем в диалоге выбора файла;
en: Add enables to add the new XSD schema file selected by a user in the file selection dialog to the list.

source: Доля класса – отношение количества наблюдений в классе к общему числу наблюдений.
en: Class rate: the ratio of observations number in the class to the total count of observations.

source: Другие действия — вызывает контекстное меню с расширенным набором команд.
en: Other actions enable to call the context menu with the extended set of commands.

source: Закрепить столбец / Снять закрепление столбца — закрепленное поле фиксируется в левой части окна и отделяется от незакрепленной части вертикальной линией.
en: Freeze column / Unfreeze column: the frozen field is fixed in the left part of the window, and it is separated from the unfrozen part with the vertical line.

source: Закрыть все пакеты…
en: Close all packages…

source: Закрыть все — закрытие всех открытых Пакетов.
en: Close all enables to close all opened Packages.

source: Закрыть другие пакеты… — производит закрытие всех Пакетов, кроме выделенного.
en: Close other packages… enables to close all Packages, with the exception of the selected one.

source: Закрыть пакет…
en: Close package…

source: Закрыть — закрытие выделенного Пакета.
en: Close enables to close the selected Package.

source: Запуск обработки — ручная активация портов (активированный порт содержит данные);
en: Start processing provides the manual ports activations (the activated port contains data).

source: Значимость столбца – уровень значимости входного столбца, определенный на основе информационного индекса.
en: Column Significance: the significance level of the input column defined according to the information value.

source: Идентификатор – имя столбца, под которым он будет обрабатываться в наборе данных.
en: Identifier: the column name under which it will be processed in the data set.

source: Имя столбца – идентификатор столбца, под которым он будет обрабатываться в наборе данных.
en: Column name: the column identifier under which it will be processed in the data set.

source: Инвертировать тип — меняет тип границ;
en: Invert type: changes the bound type.

source: Информационный индекс – указываются значения информационных индексов IV, вычисленные по каждому входному столбцу.
en: Information value: the values of information values IV calculated for each input column are specified.

source: Использовать относительные пути базового пакета — данную опцию следует включать в Пакете с базовым узлом, если у данного узла есть относительные пути на файлы либо предполагается использовать пути в базовых узлах относительно данного Пакета.
en: Use relative paths of the base package must be enabled in the Package with base node, if this node has relative paths to files, or it is assumed to use paths in base nodes relative to this Package.

source: Итоги — показать/скрыть итоговые заголовки:
en: Show totals: show/hide final headers:

source: Левое соединение;
en: Left join.

source: Метка класса – идентификатор класса, присвоенный ему при формировании в узле конечные классы.
en: Class caption: the class identifier assigned to it while its formation in the Coarse Classes node.

source: Метка столбца – мнемоническое обозначение входного столбца, под которым он будет виден пользователю в базе или хранилище данных.
en: Column caption: the mnemonic symbol of the input column under which it will be visible for a user in the database or data warehouse.

source: Набор данных — таблица с импортированными данными.
en: Data set: the table with imported data.

source: Настроить порт — открывает диалог настройки значений переменных.
en: Configure port enables to open the dialog of configuration of the variables values.

source: Настроить факты… — открыть окно настройки фактов.
en: Configure measures…: open settings of measures window.

source: Настроить — открывает диалог выбора файла для редактирования пути к файлу XSD-схемы.
en: Configure enables to open the file selection dialog to edit the path to the XSD schema file.

source: Настройка визуализаторов — открывает диалог настройки визуализаторов;
en: Configure visualizers enables to open the dialog of the visualizers configuration.

source: Настройка — открывает диалог настройки значений переменных пользователя;
en: Settings enable to open the dialog of configuration of the user variables values.

source: Не задано — для данных, не участвующих в построении модели.
en: Unspecified: for the data that do not take part in the model training process.

source: Неиспользуемое — поле не участвует в обработке.
en: Unused: the field is not included into processing.

source: Нигде.
en: No totals.

source: Нижняя граница открыта — убирает нижнюю границу;
en: Lower bound open: removes the lower bound.

source: Нижняя граница – для числовых признаков указывается нижняя граница интервала числом.
en: Lower bound: a number is used to denote the lower bin bound for the numeric indicators.

source: Номер класса – порядковый номер, присвоенный классу при его формировании в узле Конечные классы.
en: Class number: the index number assigned to the class while its formation in the Coarse Classes node.

source: Обновить — производит обновление списка.
en: Refresh enables to refresh a list.

source: Опубликовать^1 — открывает окно для публикации Пакета.
en: Publish^1 enables to open a window for the Package publication.

source: Открыть — открывает окно выбора существующего Пакета.
en: Open enables to open the selection window of the existing Package.

source: Переменные пакета — набор переменных текущего Пакета.
en: Package variables represent a set of variables of the current Package.

source: Переменные пользователя — набор переменных, задаваемый пользователем для текущего Сценария.
en: User variables represent a set of variables set by the user of the current Workflow.

source: Переменные сессии — набор переменных текущей сессии.
en: Session variables represent a set of variables of the current session.

source: Переменные системы — набор переменных окружения операционной системы.
en: System variables represent a set of variables of the operating system environment.

source: Переменные — итоговый набор всех нижеперечисленных переменных Сценария.
en: Variables represent the final set of all Workflow variables listed below.

source: Переместить вверх — поднять выражение на одну позицию вверх по списку;
en: Move up enables to move the expression one item position up the list.

source: Переместить вниз — опустить выражение на одну позицию вниз по списку;
en: Move down enables to move the expression one item position down the list.

source: Подключение — принимает параметры подключения к базе данных;
en: Connection accepts parameters of connection to database.

source: Показать в папке — открывает папку, содержащую выделенный Пакет и устанавливает на нем фокус.
en: Show in folder enables to open the folder containing the selected Package and takes focus on it.

source: Поле «<Метка столбца> Значимость».
en: «<Column caption> Significance» Field.

source: Поле «<Метка столбца> Метка» – метка конечного класса, полученная автоматическим путем (числовые границы, если это непрерывная переменная, или перечисление уникальных значений через «;», если переменная дискретная).
en: «<Column caption> Caption» field: the automatically received caption of the coarse class (numeric limits if it is a continuous variable, or enumeration of unique values with «;» if it is a discrete variable).

source: Поле «<Метка столбца> Номер класса» – идентификатор конечного класса, целое число (начиная с 0) – столбец создается всегда.
en: «<Column caption> Class number» field: the coarse class identifier, integer (starting from 0): a column is always created.

source: Полное соединение;
en: Full join.

source: Поля исходного набора данных (значения не изменяются).
en: The source data set fields (values are not changed).

source: Поля — показать/скрыть список полей набора данных.
en: Fields: show/hide the list of the data set fields.

source: Правое соединение;
en: Right join.

source: Предквантование – показывает применялось ли предквантование в процессе формирования конечных классов.
en: Prequantization shows whether prequantization has been used in the process of the coarse classes generation.

source: Приостановить автовычисление — отключить обновление заголовков и данных.
en: Defer layout update: disable update of headers and data.

source: Прогнозируемое — для данных, соответствующих временному ряду.
en: Forecast: for the data mapping the time series.

source: Равная ширина колонок.
en: Equal column width.

source: Равная ширина фактов.
en: Equal measure width.

source: Развернуть — развернуть иерархию измерений куба:
en: Expand: expand the cube dimensions hierarchy:

source: Разность.
en: Difference.

source: Редактировать метки порта — открывает диалог редактирования метки порта.
en: Edit port captions enables to open the dialog of the port caption editing.

source: Редактировать свойства…
en: Edit properties…

source: Редактировать — задание параметров выражения;
en: Edit enables to set expression parameters.

source: Результат выполнения — переменная целого типа, содержащая значение 0 в случае успешного завершения выполняемой программы;
en: Execution result: the integer variable that contains 0 in the case of the successful completion of the executed program;

source: Свернуть — свернуть иерархию измерений куба:
en: Collapse: collapse the cube dimensions hierarchy:

source: Сводка — переменные:
en: Summary: variables:

source: Свойства — открывает окно настройки свойств выделенного Пакета.
en: Properties enables to open the properties configuration window of the selected Package.

source: Создать новый пакет…
en: New package…

source: Создать черновик
en: New draft

source: Создать черновик — создание временного Пакета, без текущего сохранения.
en: New Draft enables to create a temporary Package without current saving.

source: Создать — открывает окно для задания пути и имени нового Пакета, после сохранения открывает данный пустой Пакет.
en: New enables to open a window to set a path and name of the new Package, it also enables to open this empty Package after saving.
